       IDENTIFICATION DIVISION.
       PROGRAM-ID. NUMGEN.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUTPUTFILE
           ASSIGN TO 'output.txt'
           ORGANISATION LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD OUTPUTFILE
           RECORD IS VARYING FROM 0 to 10000000 CHARACTERS.
       01 OUTPUTFILESTRING PIC X(1000).
       WORKING-STORAGE SECTION.
      *Using N(20) is probably better than X(20) but with GnuCobol 3.2.0 the
      *national picture symbol is considered unstable
       01 PREFIX PIC X(500).
       01 SUFFIX PIC X(500).
       01 STARTNUMBERSTRING PIC X(25).
       01 ENDNUMBERSTRING PIC X(25).
       01 STARTNUMBER PIC 9(25).
       01 ENDNUMBER PIC 9(25).
       01 CURRENTNUMBER PIC 9(25).
       01 CURRENTNUMBERSTRING PIC Z(25)9.
       01 CONCATSTRING PIC X(1000).
       PROCEDURE DIVISION.
           DISPLAY "Enter start number:"
           ACCEPT STARTNUMBERSTRING.
           MOVE STARTNUMBERSTRING TO STARTNUMBER.
           DISPLAY "Enter end number:"
           ACCEPT ENDNUMBERSTRING.
           MOVE ENDNUMBERSTRING TO ENDNUMBER.
           DISPLAY "Enter prefix:"
           ACCEPT PREFIX.
           STRING
               FUNCTION TRIM(PREFIX) X'00'
               DELIMITED BY 9999
               INTO PREFIX
               END-STRING.
           DISPLAY "Enter suffix:"
           ACCEPT SUFFIX.
           STRING
               FUNCTION TRIM(SUFFIX) X'00'
               DELIMITED BY 9999
               INTO SUFFIX
               END-STRING.

           MOVE STARTNUMBER TO CURRENTNUMBER.

           OPEN OUTPUT OUTPUTFILE.
           PERFORM RUNWRITE UNTIL CURRENTNUMBER > ENDNUMBER
           CLOSE OUTPUTFILE.
           STOP RUN.

       RUNWRITE.
           MOVE CURRENTNUMBER TO CURRENTNUMBERSTRING.
           STRING
               PREFIX DELIMITED BY X'00'
               FUNCTION TRIM(CURRENTNUMBERSTRING)
               SUFFIX DELIMITED BY X'00'
               INTO CONCATSTRING
               END-STRING.
           MOVE CONCATSTRING TO OUTPUTFILESTRING.
           WRITE OUTPUTFILESTRING.
           COMPUTE CURRENTNUMBER = CURRENTNUMBER + 1.
           EXIT.

       END PROGRAM NUMGEN.
